---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsTrisertypeNosingLength
source: html/10193223-9d8b-dd1e-6739-a5e5f504526f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsTrisertypeNosingLength Property

"Nosing Length"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsTrisertypeNosingLength { get; }
```